maksidze/SmartESC_STM32_M365/Core/Src/main.c
		////////////////////////////////////////////
		////////////////////////////////////////////
		////////////////////////////////////////////
#define AUTOSTART 0
#if AUTOSTART
		if (main_loop_counter < LOOP_INC) {
			speedL = main_loop_counter;
		} else {
			speedL = LOOP_INC;
		}
#endif
		////////////////////////////////////////////
		////////////////////////////////////////////
		////////////////////////////////////////////

		// ####### SET OUTPUTS (if the target change is less than +/- 100) #######
		if ((speedL > lastSpeedL - 100 && speedL < lastSpeedL + 100)
				&& (speedR > lastSpeedR - 100 && speedR < lastSpeedR + 100)) {
			pwml = speedL;
		}

		// ####### CALC BOARD TEMPERATURE #######
		filtLowPass32(adc_buffer.temp, TEMP_FILT_COEF, &board_temp_adcFixdt);
		board_temp_adcFilt = (int16_t) (board_temp_adcFixdt >> 16); // convert fixed-point to integer
		board_temp_deg_c = (TEMP_CAL_HIGH_DEG_C - TEMP_CAL_LOW_DEG_C)
				* (board_temp_adcFilt - TEMP_CAL_LOW_ADC)
				/ (TEMP_CAL_HIGH_ADC - TEMP_CAL_LOW_ADC) + TEMP_CAL_LOW_DEG_C;

		// ####### FEEDBACK SERIAL OUT #######
		if (main_loop_counter % 2 == 0) {  // Send data periodically every 10 ms
			Feedback.start = (uint16_t) SERIAL_START_FRAME;
			Feedback.cmd1 = (int16_t) cmd1;
			Feedback.cmd2 = (int16_t) cmd2;
			Feedback.speedR_meas = (int16_t) rtY_Right.n_mot;
			Feedback.speedL_meas = (int16_t) rtY_Left.n_mot;
			Feedback.batVoltage = (int16_t) (batVoltage * BAT_CALIB_REAL_VOLTAGE
					/ BAT_CALIB_ADC);
			Feedback.boardTemp = (int16_t) board_temp_deg_c;

			if (__HAL_DMA_GET_COUNTER(huart3.hdmatx) == 0) {
				Feedback.cmdLed = (uint16_t) sideboard_leds_R;
				Feedback.checksum = (uint16_t) (Feedback.start ^ Feedback.cmd1
						^ Feedback.cmd2 ^ Feedback.speedR_meas
						^ Feedback.speedL_meas ^ Feedback.batVoltage
						^ Feedback.boardTemp ^ Feedback.cmdLed);

				HAL_UART_Transmit_DMA(&huart3, (uint8_t*) &Feedback,
						sizeof(Feedback));
			}
		}

#if KX
	    // ####### POWEROFF BY POWER-BUTTON #######
	    poweroffPressCheck();

	    // ####### BEEP AND EMERGENCY POWEROFF #######
	    if ((TEMP_POWEROFF_ENABLE && board_temp_deg_c >= TEMP_POWEROFF && speedAvgAbs < 20) || (batVoltage < BAT_DEAD && speedAvgAbs < 20)) {  // poweroff before mainboard burns OR low bat 3
	      poweroff();
	    } else if (rtY_Left.z_errCode || rtY_Right.z_errCode) {                                           // 1 beep (low pitch): Motor error, disable motors
	      enable = 0;
	      beepCount(1, 24, 1);
	    } else if (timeoutFlagADC) {                                                                      // 2 beeps (low pitch): ADC timeout
	      beepCount(2, 24, 1);
	    } else if (timeoutFlagSerial) {                                                                   // 3 beeps (low pitch): Serial timeout
	      beepCount(3, 24, 1);
	    } else if (timeoutCnt > TIMEOUT) {                                                                // 4 beeps (low pitch): General timeout (PPM, PWM, Nunchuck)
	      beepCount(4, 24, 1);
	    } else if (TEMP_WARNING_ENABLE && board_temp_deg_c >= TEMP_WARNING) {                             // 5 beeps (low pitch): Mainboard temperature warning
	      beepCount(5, 24, 1);
	    } else if (BAT_LVL1_ENABLE && batVoltage < BAT_LVL1) {                                            // 1 beep fast (medium pitch): Low bat 1
	      beepCount(0, 10, 6);
	    } else if (BAT_LVL2_ENABLE && batVoltage < BAT_LVL2) {                                            // 1 beep slow (medium pitch): Low bat 2
	      beepCount(0, 10, 30);
	    } else if (BEEPS_BACKWARD && ((speed < -50 && speedAvg < 0) || MultipleTapBrake.b_multipleTap)) { // 1 beep fast (high pitch): Backward spinning motors
	      beepCount(0, 5, 1);
	      backwardDrive = 1;
	    } else {  // do not beep
	      beepCount(0, 0, 0);
	      backwardDrive = 0;
	    }


	    // ####### INACTIVITY TIMEOUT #######
	    if (abs(speedL) > 50 || abs(speedR) > 50) {
	      inactivity_timeout_counter = 0;
	    } else {
	      inactivity_timeout_counter++;
	    }
	    if (inactivity_timeout_counter > (INACTIVITY_TIMEOUT * 60 * 1000) / (DELAY_IN_MAIN_LOOP + 1)) {  // rest of main loop needs maybe 1ms
	      poweroff();
	    }
#endif

		// HAL_GPIO_TogglePin(LED_PORT, LED_PIN);                 // This is to measure the main() loop duration with an oscilloscope connected to LED_PIN
		// Update main loop states
		lastSpeedL = speedL;
		lastSpeedR = speedR;
		main_loop_counter++;
		timeoutCnt++;

		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin,
				(main_loop_counter % 400 > 200));

		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
	}
	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };
	RCC_PeriphCLKInitTypeDef PeriphClkInit = { 0 };

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
	RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL16;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}
	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
		Error_Handler();
	}
	PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
	PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
		Error_Handler();
	}
}

/**
 * @brief ADC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_ADC1_Init(void) {

	/* USER CODE BEGIN ADC1_Init 0 */

